# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.observability.data.azurerm_client_config.current: Reading...
module.observability.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.azure_service_operator.azapi_resource.aso will be updated in-place
  ~ resource "azapi_resource" "aso" {
      ~ body                      = {
          ~ properties = {
              ~ kustomizations             = {
                  ~ aso = {
                      ~ postBuild              = {
                          ~ substitute = {
                              ~ AZURE_CLIENT_ID       = "bb11094e-eff6-45c9-8498-c9d499ef3a8f" -> (known after apply)
                              ~ AZURE_TENANT_ID       = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
                                # (2 unchanged attributes hidden)
                            }
                        }
                        # (7 unchanged attributes hidden)
                    }
                }
                # (5 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/auth-at22-aks-rg/providers/Microsoft.ContainerService/managedClusters/auth-at22-aks/providers/Microsoft.KubernetesConfiguration/fluxConfigurations/azure-service-operator"
      + location                  = (known after apply)
        name                      = "azure-service-operator"
      ~ output                    = {} -> (known after apply)
      + tags                      = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.azure_service_operator.azurerm_federated_identity_credential.aso_fic must be replaced
-/+ resource "azurerm_federated_identity_credential" "aso_fic" {
      ~ id                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/aso-auth-at22-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aso-identity-auth-at22/federatedIdentityCredentials/aso-aks-auth-at22" -> (known after apply)
        name                = "aso-aks-auth-at22"
      ~ parent_id           = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/aso-auth-at22-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aso-identity-auth-at22" -> (known after apply) # forces replacement
      ~ resource_group_name = "aso-auth-at22-rg" -> "auth-at22-aso-rg" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.azure_service_operator.azurerm_resource_group.aso_rg must be replaced
-/+ resource "azurerm_resource_group" "aso_rg" {
      ~ id         = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/aso-auth-at22-rg" -> (known after apply)
      ~ name       = "aso-auth-at22-rg" -> "auth-at22-aso-rg" # forces replacement
      - tags       = {} -> null
        # (2 unchanged attributes hidden)
    }

  # module.azure_service_operator.azurerm_role_assignment.aso_contrib_role_assignment must be replaced
-/+ resource "azurerm_role_assignment" "aso_contrib_role_assignment" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/DIS_auth-at22_main-rg/providers/Microsoft.Authorization/roleAssignments/046d1ab3-cfdf-8520-cda5-891aaec14e0b" -> (known after apply)
      ~ name                                   = "046d1ab3-cfdf-8520-cda5-891aaec14e0b" -> (known after apply)
      ~ principal_id                           = "f42b87b6-8346-4ed9-a425-a5ee82d9a8be" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_name                   = "dis-identity-admin-auth-at22" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.azure_service_operator.azurerm_user_assigned_identity.aso_identity must be replaced
-/+ resource "azurerm_user_assigned_identity" "aso_identity" {
      ~ client_id           = "bb11094e-eff6-45c9-8498-c9d499ef3a8f" -> (known after apply)
      ~ id                  = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/aso-auth-at22-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aso-identity-auth-at22" -> (known after apply)
        name                = "aso-identity-auth-at22"
      ~ principal_id        = "f42b87b6-8346-4ed9-a425-a5ee82d9a8be" -> (known after apply)
      ~ resource_group_name = "aso-auth-at22-rg" -> "auth-at22-aso-rg" # forces replacement
      - tags                = {} -> null
      ~ tenant_id           = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/altinn-auth-test/auth-at22-aks-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/auth-at22-aks-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_auth-at22-aks-rg.tfstate.tfplan` |